---
type: PointLightShape
namespace: Autodesk.Revit.DB.Lighting
version: 2024
members: 2
tags: [revit-api, class]
---

# PointLightShape

`Autodesk.Revit.DB.Lighting.PointLightShape` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | PointLightShape | — | `` |
| Constructor | PointLightShape | 2013 | `public PointLightShape ()` |